quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V11A3.C
	if(0==Cache)	//返回空地址
		return 0;
	//-------------------------先发送缓存标号为1号数据
	for(i=0;i<ampArrySize;i++)
	{		
		if(1==Cache[i].arry)		//缓存数据不为0
		{
			return &Cache[i];
		}
	}
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char del_cache_data(ampPortDef port)
{
	unsigned short	i=0;
	ampCachedef* Cache	= get_cache_addr(port);
	
	if(0==Cache)	//返回空地址
		return 0;
	//-------------------------先发送缓存标号为1号数据
	for(i=0;i<ampArrySize;i++)
	{
		if((Cache[i].arry))
		{
			Cache[i].arry-=1;
		}
	}
	return 1;
}
//------------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char get_ack_wait_flag(ampPortDef port)
{
	//0--无需等待应答，1--需等待应答
	if(NonPort	==	port)
		return 0;
	else if(PcPort	==	port)
		return ampsys.AckW.PC;
	else if(CabPort	==	port)
		return ampsys.AckW.CB;
	else if(LayPort	==	port)
		return ampsys.AckW.LY;
	else
		return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_ack_wait_flag(ampPortDef port)
{
	//0--无需等待应答，1--需等待应答
	if(NonPort	==	port)
		return;
	else if(PcPort	==	port)
		ampsys.AckW.PC =	1;
	else if(CabPort	==	port)
		ampsys.AckW.CB =	1;
	else if(LayPort	==	port)
		ampsys.AckW.LY =	1;
	else
		return;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void del_ack_wait_flag(ampPortDef port)
{
	//0--无需等待应答，1--需等待应答
	if(NonPort	==	port)
		return;
	else if(PcPort	==	port)
		ampsys.AckW.PC =	0;
	else if(CabPort	==	port)
		ampsys.AckW.CB =	0;
	else if(LayPort	==	port)
		ampsys.AckW.LY =	0;
	else
		return;
}
//------------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void Pc_Server(void)
{
	pc_receive_data_process();
	pc_send_data_process();
}
//------------------------------------------------------------------------------




/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void Cab_Server(void)
{
	//--------------------------------------
	//主板:接收PC数据，广播数据，内部使用和转发
	//接收到总线数据，上传到PC
	cab_receive_data_process();
	//================================================数据发送	
	cab_send_data_process();
}
//------------------------------------------------------------------------------




/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void Lay_Server(void)
{
	//--------------------------------------
	//主板:接收PC数据，广播数据，内部使用和转发
	//接收到总线数据，上传到PC
	lay_receive_data_process();
	lay_send_data_process();
}
//------------------------------------------------------------------------------




/*******************************************************************************
* 函数名			:	Cmd_Process
* 功能描述		:	柜消息处理：处理针对本柜的消息/命令
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
static void lay_data_process(unsigned char* pBuffer,unsigned short len)
{  
	unsigned char 	cab_addr	=	0;	//柜地址
	unsigned char 	lay_addr	=	0;	//层地址
	unsigned char		cmd	=	ampCmdNone;
	unsigned char		dir	=	0;
	unsigned short	Saved_len	=	0;

	ampphydef* frame	=	api_get_frame(pBuffer,len);
	if(0==frame)
		return;
	cmd	=	frame->msg.cmd.cmd;
	dir	=	frame->msg.cmd.dir;
	//------------------------------------------检查数据传输方向，层控制接口只接收上传数据
	if(0==dir)	//下发
		return;
	//------------------------------------------检查是否为应答
	if(ampCmdAck==cmd)	//应答，删除一缓存
	{
		received_ack_process(LayPort);
		return;
	}
	//==========================================数据类通讯
	
	//------------------------------------------主柜数据转发到PC
	if(ampsys.sysdata.MB_Flag)	//主柜
	{
		Saved_len	=	 set_cache_data(PcPort,frame);			//发往PC缓存
		set_ackdown_frame(LayPort);
		return;
	}
	else	//辅柜数据转到柜连接端口
	{
		Saved_len	=	 set_cache_data(CabPort,frame);			//发往柜接口缓存
		set_ackdown_frame(LayPort);
		return;
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void cmd_process(ampphydef* frame)
{
	unsigned char	cab_addr	=	0;	//柜地址
	unsigned char cmd				=	0;
	unsigned char parameter	=	0;
	
	if(0==frame)
		return;
	
	cmd	=	frame->msg.cmd.cmd;
	cab_addr		=	frame->msg.addr.address1;		//柜地址
	parameter		=	frame->msg.data[0];				//如果是控制类消息时的请求标志
	
	if((0xFF!=cab_addr)&&(cab_addr!=ampsys.sysdata.Cab_Addr))	//地址
		return;
	//------------------------------与层板供电相关的命令1
	if((ampCmdLcdConf == cmd)||(ampCmdLcdData==cmd))       //LCD配置命令
  {
    set_layer_power(1);
  }
	
