quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V11A3.C
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void lock_status_updata(void)
{
	ampphydef	frame;
	frame.head	=	headcode;
	frame.msg.length	=	6;		//cmd,addr1,addr2,addr3,data0,data1
	frame.msg.cmd.cmd	=	ampCmdLock;
	frame.msg.cmd.rv	=	0;
	frame.msg.cmd.dir	=	1;
	frame.msg.addr.address1	=	ampsys.sysdata.Cab_Addr;
	frame.msg.addr.address2	=	0;
	frame.msg.addr.address3	=	0;
	frame.msg.data[0]	=	ampStypeLock;
	frame.msg.data[1]	=	ampsys.status.lock;
	
	api_set_frame(&frame,ampCmdLock,ampDirUp);		//设置消息帧
	
	if(ampsys.sysdata.MB_Flag)	//主板
		set_cache_data(PcPort,&frame);
	else
		set_cache_data(CabPort,&frame);
}
//------------------------------------------------------------------------------



/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_door(unsigned char flag)
{
	//flag不为0表示有请求
	if(0==flag)
	{
		ampsys.request.unlock	=	0;
		ampsys.time.LockTime	=	0;	//开锁时间2秒
		ampResLock;
	}
	else
	{
		ampsys.request.unlock	=	1;
		ampsys.time.LockTime	=	ampUnlockOuttime;	//开锁时间2秒
		ampUnLock;
	}	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_backlight(unsigned char flag)
{
	//flag不为0表示有请求
	if(0==flag)
	{
		ampBakkLightOff;
	}
	else
	{
		ampBakkLightOn;
	}	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_layer_power(unsigned char flag)
{
	//flag不为0表示有请求
	if(0==flag)
	{
		ampLayPowerOff;
	}
	else
	{
		ampLayPowerOn;
	}	
}
//------------------------------------------------------------------------------




/*******************************************************************************
*函数名			:	getframe
*功能描述		:	获取帧地址，返回帧长度
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void set_ackup_frame(ampPortDef Port)
{  
	ampphydef*	frame;

	ampCachedef*	Cache;
	if(PcPort	==	Port)
		Cache	=	&ampsys.commdata.PcAck;
	else if(CabPort	==	Port)
		Cache	=	&ampsys.commdata.CbAck;
	else if(LayPort	==	Port)
		Cache	=	&ampsys.commdata.LyAck;
	else
		return ;	

	frame=(ampphydef*)Cache->data;
	
	frame->head	=	headcode;
	frame->msg.length	=	5;
	frame->msg.cmd.cmd	=	ampCmdAck;
	frame->msg.cmd.rv		=	0;
	frame->msg.cmd.dir	=	1;
	frame->msg.addr.address1	=	ampsys.sysdata.Cab_Addr;		//向上应答为柜地址
	frame->msg.addr.address2	=	0;
	frame->msg.addr.address3	=	0;
	frame->msg.data[0]=0;
	
	Cache->arry	=	1;
	Cache->size	=	api_set_frame(frame,ampCmdAck,1);    //补充消息的CRC和结束符，返回帧长度
}
/*******************************************************************************
*函数名			:	getframe
*功能描述		:	获取帧地址，返回帧长度
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void set_ackdown_frame(ampPortDef Port)
{  
  ampphydef*	frame;

	ampCachedef*	Cache;
	if(PcPort	==	Port)
		Cache	=	&ampsys.commdata.PcAck;
	else if(CabPort	==	Port)
		Cache	=	&ampsys.commdata.CbAck;
	else if(LayPort	==	Port)
		Cache	=	&ampsys.commdata.LyAck;
	else
		return;	

	frame=(ampphydef*)Cache->data;
	
	frame->head	=	headcode;
	frame->msg.length	=	5;
	frame->msg.cmd.cmd	=	ampCmdAck;
	frame->msg.cmd.rv		=	0;
	frame->msg.cmd.dir	=	0;
	frame->msg.addr.address1	=	0x00;		//向下应答无地址
	frame->msg.addr.address2	=	0;
	frame->msg.addr.address3	=	0;
	frame->msg.data[0]=0;
	
	Cache->arry	=	1;
	Cache->size	=	api_set_frame(frame,ampCmdAck,0);    //补充消息的CRC和结束符，返回帧长度
}
//------------------------------------------------------------------------------




/*******************************************************************************
*函数名			:	LockStatusUpdata
*功能描述		:	上报锁状态
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void set_comm_time_out_msg(ampPortDef Port,ampphydef* frame)
{
  unsigned char databuffer[32]={0};
  unsigned short framlength = 0;  //生成的消息长度
  unsigned short datalength = 2;  //需要上报的数据字节数
  ampphydef  ampframe;
	
	ampframe.head	=	headcode;
	ampframe.msg.length		=	6;
	ampframe.msg.cmd.cmd	=	ampCmdSta;
	ampframe.msg.cmd.rv		=	0;
	ampframe.msg.cmd.dir	=	1;
	ampframe.msg.addr.address1	=	frame->msg.addr.address1;
	ampframe.msg.addr.address2	=	frame->msg.addr.address2;
	ampframe.msg.addr.address3	=	frame->msg.addr.address3;
	ampframe.msg.data[0]	=	ampStypeComm;
	ampframe.msg.data[1]	=	AmpCommTimeOut;
	
  switch(Port)
  {
    case  NonPort   : return ;   //不继续执行
    case  PcPort    : return;    //PC接口发送缓存
      break;
    case  CabPort   ://柜接口发送缓存
                      ampframe.msg.addr.address2 = 0;
                      ampframe.msg.addr.address3 = 0;
      break;
    case  LayPort   ://层接口发送缓存
      break;
    case  CardPort  ://读卡器接口发送缓存
      break;
    default :return;      //不继续执行 
  }
	api_set_frame(&ampframe,ampCmdSta,1);
	set_cache_data(Port,&ampframe);
}
//------------------------------------------------------------------------------



/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void SwitchID_Server(void)
{
  static unsigned char id=0;
  static unsigned char power_on_flag=0; //上电时为0

	if(0!=ampsys.time.swicthidtime)
		return;
	ampsys.time.swicthidtime	=	2000;
  if(0==power_on_flag)  //刚上电
  {
    power_on_flag = 1;  //已上电完成
    id  = SWITCHID_ReadLeft(&ampSwitchID)&0x3F;
  }
  else
  {
		unsigned char new_id  = 0;
		new_id  = SWITCHID_ReadLeft(&ampSwitchID)&0x3F;
		if(id != new_id)  //重新初始化
		{
			power_on_flag = 0;
		}
  }
}

//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void door_server(void)
{
	if(ampsys.time.LockTime>0)
	{
		if(ampsys.time.LockTime<ampUnlockOuttime-100)
		{
			if(ampGetLockSts)			//锁未打开
			{
				ampUnLock;
			}
			else if(ampsys.time.LockTime>200)
			{
				ampsys.time.LockTime	=	200-1;	//延迟500ms释放锁
			}
		}
		else
		{
			ampUnLock;
		}
	}
	else
	{
		ampResLock;
		if(0!=ampsys.request.unlock)		//请求开锁
		{
			if(ampGetLockSts)		//门状态--未打开
			{
				ampsys.status.lock			=	1;
				ampsys.status.unlockerr	=	1;//开锁失败								
			}
			else	//开锁失败
			{
				set_backlight(1);	//亮背光
				ampsys.status.lock	=	0;
				ampsys.status.unlockerr	=	0;//开锁失败
			}
			ampResLock;
			ampsys.request.unlock	=	0;	//清除开锁请求
			lock_status_updata();
		}
		else
		{
			if(ampGetLockSts)			//门状态--关闭
			{
				if(0==ampsys.status.lock)		//关闭门
				{
					set_backlight(0);		//关背光
					set_layer_power(0);	//关层板电源
					ampsys.status.lock	=	1;//0--锁为开状态，1--锁住状态
				}
			}
			else		//手动开门
			{
				if(1==ampsys.status.lock)	//原来为关闭状态
				{
					set_backlight(1);	//亮背光
					ampsys.status.lock	=	0;//0--锁为开状态，1--锁住状态
				}			
			}
		}
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Led_Server(void)
{
  static unsigned short freshen_led_time=0;
  static unsigned char led_stata=0;
  if(freshen_led_time++>10)
  {
		freshen_led_time	=	0;
    led_stata++;
		//____________使能片选
		SPI_CS_LOW(&stLed);
		SPI_I2S_SendData(stLed.Port.SPIx, led_stata);				//发送数据
//    SPI_ReadWriteByteSPI(&stLed,led_stata);
		//____________取消片选	
		SPI_CS_HIGH(&stLed);
  }  
}






